Enterprise_Serivces/Prod/SilverGroup2/SecurityService/result1/Iteration1/t1_http.xml

<?xml-stylesheet href="..\http.xsl" type="text/xsl"?>
<report vuGenInstallDir="C:\Program Files (x86)\HP\LoadRunner\">
  <http>
    <request>
      <header>POST /SecurityService.svc HTTP/1.1
Content-Type: text/xml; charset=utf-8
Cache-Control: no-cache
SOAPAction: "http://www.gamestop.com/services/channel/security/contracts/2010/05/ISecurityService/GetValidDevices"
User-Agent: Mozilla/4.0 (compatible; MSIE 6.0; MS Web Services Client Protocol 1.1.4322.2032)
Accept-Encoding: gzip, deflate
Accept: */*
Connection: Keep-Alive
Host: securityservicechannelqa1.testgs.pvt
Content-Length: 1119

</header>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"&gt;
  &lt;soap:Header&gt;
    &lt;wsa:Action&gt;http://www.gamestop.com/services/channel/security/contracts/2010/05/ISecurityService/GetValidDevices&lt;/wsa:Action&gt;
    &lt;wsa:MessageID&gt;uuid:53b030f0-305e-4ab1-b60b-0fe4dac28073&lt;/wsa:MessageID&gt;
    &lt;wsa:ReplyTo&gt;
      &lt;wsa:Address&gt;http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous&lt;/wsa:Address&gt;
    &lt;/wsa:ReplyTo&gt;
    &lt;wsa:To&gt;http://securityservicechannelqa1.testgs.pvt/SecurityService.svc&lt;/wsa:To&gt;
  &lt;/soap:Header&gt;
  &lt;soap:Body&gt;
    &lt;GetValidDevices xmlns="http://www.gamestop.com/services/channel/security/contracts/2010/05"&gt;
      &lt;request&gt;
        &lt;MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05"&gt;test&lt;/MachineName&gt;
        &lt;OpenIdClaimedIdentifier xmlns="http://www.gamestop.com/services/channel/security/messages/2014/05"&gt;/ID/09191613474481hAvincqn-0_2dp6SLAQhNQ&lt;/OpenIdClaimedIdentifier&gt;
      &lt;/request&gt;
    &lt;/GetValidDevices&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;</body>
    </request>
    <response>
      <header>HTTP/1.1 200 OK
Content-Length: 670
Content-Type: text/xml; charset=utf-8
Server: Microsoft-IIS/8.5
Date: Tue, 14 Feb 2017 17:44:54 GMT

</header>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s:Body&gt;
    &lt;GetValidDevicesResponse xmlns="http://www.gamestop.com/services/channel/security/contracts/2010/05"&gt;
      &lt;GetValidDevicesResult xmlns:a="http://www.gamestop.com/services/channel/security/messages/2014/05" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"&gt;
        &lt;a:Status xmlns:b="http://www.gamestop.com/services/core/contracts/2010/05"&gt;
          &lt;b:StatusCode&gt;404.AuthenticationService.001&lt;/b:StatusCode&gt;
          &lt;b:StatusReason&gt;Not Found&lt;/b:StatusReason&gt;
        &lt;/a:Status&gt;
        &lt;a:ValidatedDevices xmlns:b="http://www.gamestop.com/services/core/entities/2010/05" /&gt;
      &lt;/GetValidDevicesResult&gt;
    &lt;/GetValidDevicesResponse&gt;
  &lt;/s:Body&gt;
&lt;/s:Envelope&gt;</body>
    </response>
  </http>
</report>